# 😆학습 목표
- 누구나 쉽게 접근할 수 있는 방법으로 3스테이지 분량의 소규모 게임을 개발할 수 있습니다.
- 언리얼의 주요 클래스와 활용 용도를 이해하고 나만의 게임 로직을 작성할 수 있습니다.
- 프로그래밍 기초 지식이 없어도 누구나 작성할 수 있는 비주얼스크립트 기법으로 제작됩니다.
![image](https://github.com/user-attachments/assets/a9a0ee7e-fa47-46b3-beb7-03bb98c1a177)

# 😆예시 화면
![image](https://github.com/user-attachments/assets/d73ba69b-d810-4864-bed3-d1a9726c2324)
> 강의 자료로 작성된 실제 게임화면입니다.

# 😆주요 구현 기능
- 인터넷에서 다운받은 캐릭터를 게임이 넣는 방법
- 키보드, 마우스, 게임패드 등을 이용해 캐릭터와 게임을 조작하는 방법
- 서로 피 튀기는 전투를 하며 대미지, 사망처리, 스테이지 클리어, 보상 획득 등
- 스테이지를 꾸미고 함정이나 움직이는 발판 등 기물을 배치하는 레벨 디자인
- 내가 원하는 스테이지를 선택하거나 해금하는 시스템
- 체력 게이지, 게임 시간 표시 등은 물론 메인메뉴, 게임오버 메뉴 등 UI 제작
- 체크포인트에 의한 자동 저장 및 불러오기 시스템
- 화면을 좀 더 다채롭게 꾸미는 특수효과와 그래픽 처리 등

# 😆전체 흐름
- 각 스테이지에는 달성해야 할 목표이 있습니다.(예 - 보스의 처치, 제한 시간 내 목적지 도착 등)
- 목적을 달성하면 다음 스테이지로 넘어가게 됩니다.
- 게임 오버가 되면, 메인 메뉴로 돌아갈지 재도전을 할지 선택할 수 있는 메뉴창이 나타납니다.
![image](https://github.com/user-attachments/assets/7ea6e937-4e93-40c9-a191-3f33fbe6e710)
> 이해를 돕기 위한 AI 이미지입니다.

# 😆상세 일정
| 주차  | 강의 주제            | 학습 내용                                                                                                                                         |
|-------|-----------------------|----------------------------------------------------------------------------------------------------------------------------------------------------|
| 1주차 | 언리얼 기본 사용법    | 이 제작도구를 활용하기 위해 설치 방법부터 기본적인 사용법을 익혀야겠죠                                                                           |
|       | 기초적인 프로그래밍   | 우리가 무엇을 만들고 싶어하는지 컴퓨터에게 설명을 해줘야 합니다! <br> 꼭 필요한 부분을 그때그때 이해하기 쉬운 예제로 풀이해 드립니다.          |
| 2주차 | 캐릭터의 조작         | 다른 사람들이 디자인한 멋진 캐릭터를 언리얼 엔진으로 가져와 봅니다. <br> 그리고 입력 장치를 통해 이 캐릭터를 공간을 누비며 달리고 점프하게 만듭니다. |
| 3주차 | 전투 만들기           | 평화를 사랑하는 개발자답게 빌런을 설정하고 응징하도록 합니다. <br> 그러나 숨 막히는 티키타카가 있어야겠죠? 적에게도 판단력을 부여합니다.  |
| 4주차 | 전투 다듬기           | 막상 만들어보니, 좀 더 잘 할 수 있을 것 같은 느낌이 듭니다. <br> 어색한 부분을 최대한 없애고 실제 게임처럼 하나씩 다듬어 봅니다.         |
| 5주차 | UI 만들기             | 이제 화면에 게임에 필요한 정보를 띄워 봅니다. 체력이나 이름, 상태 같은걸요. <br> 스테이지를 클리어하거나 게임오버가 되었을 때 유저에게 친절함을 베풀 수 있습니다. |
| 6주차 | 레벨 디자인           | 전투 외에도 다양한 함정이나 퍼즐을 추가합니다. <br> 각 스테이지마다 고유한 동기를 부여하여 유저에게 다채로운 재미를 주도록 합니다.       |
| 7주차 | 디버깅                | 선생님이 시키는대로만 만드니 재미가 없는 것 같습니다. 나만의 게임을 갖고 싶습니다. <br> 그런데 생각대로 잘 안되네요. 내 게임의 어디에 문제가 있는지 찾는 방법은 무엇일까요? |
| 8주차 | 다음은 어디인가요     | 이제 나는 게임을 출시할 수 있습니다. <br> 이제 무엇을 해야 할까요? 더 잘하고 싶다면 무슨 공부를 해야 할까요?                           |

# 강의 자료
- 수강생이라면 누구나 언제든 강의자료를 자유롭게 다시 볼 수 있습니다.
- 여러분과 의견을 공유하고 소통할 수 있는 채널이 항상 열려 있습니다.
- 여러분이 만든 게임을 언제든지 가져와서 보여주세요!
